Lelvels/ESP8266_C2D/src/main.cpp
#include <string.h>
#include <stdbool.h>
#include <time.h>

#include <cstdlib>

#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <WiFiClientSecure.h>
#include <base64.h>
#include <bearssl/bearssl.h>
#include <bearssl/bearssl_hmac.h>
#include <libb64/cdecode.h>

#include <az_result.h>
#include <az_span.h>
#include <az_iot_hub_client.h>

#include <ArduinoJson.h>

#include "iot_configs.h"
#include "azure_ca.h"

// Status LED: will remain high on error and pulled high for a short time for each successful send.
#define LED_PIN 2
#define BTN_PIN 4
#define sizeofarray(a) (sizeof(a) / sizeof(a[0]))
#define ONE_HOUR_IN_SECS 3600
#define NTP_SERVERS "pool.ntp.org", "time.nist.gov"
#define MQTT_PACKET_SIZE 1024

static const char* ssid = IOT_CONFIG_WIFI_SSID;
static const char* password = IOT_CONFIG_WIFI_PASSWORD;
static const char* host = IOT_CONFIG_IOTHUB_FQDN;
static const char* device_id = IOT_CONFIG_DEVICE_ID;
static const char* device_key = IOT_CONFIG_DEVICE_KEY;
static const int port = 8883;

static const int MESSAGE_SIZE = 400;
static WiFiClientSecure wifi_client;
static X509List cert((const char*)ca_pem);
static PubSubClient mqtt_client(wifi_client);
static az_iot_hub_client client;
static char sas_token[200];
static uint8_t signature[512];
static unsigned char encrypted_signature[32];
static char base64_decoded_device_key[32];
static unsigned long next_telemetry_send_time_ms = 0;
static char telemetry_topic[128];
static uint8_t telemetry_payload[MESSAGE_SIZE];
static uint32_t telemetry_send_count = 0;

int mess_type = 0;
int parking_slot_number = 0;
bool gate = true;
int btnState = LOW;

static DynamicJsonDocument doc(200);

static void connectToWiFi()
{
  Serial.begin(115200);
  Serial.println();
  Serial.print("Connecting to WIFI SSID ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print(".");
  }

  Serial.print("WiFi connected, IP address: ");
  Serial.println(WiFi.localIP());
}

static void initializeTime()
{
  Serial.print("Setting time using SNTP");

  configTime(-5 * 3600, 0, NTP_SERVERS);
  time_t now = time(NULL);
  while (now < 1510592825)
  {
    delay(500);
    Serial.print(".");
    now = time(NULL);
  }
  Serial.println("done!");
}

static char* getCurrentLocalTimeString()
{
  time_t now = time(NULL);
  return ctime(&now);
}

static void printCurrentTime()
{
  Serial.print("Current time: ");
  Serial.print(getCurrentLocalTimeString());
}

void increaseIndex(){
  if(parking_slot_number < 3)
    parking_slot_number = parking_slot_number + 1;
  else 
    parking_slot_number = 0;

  gate = !gate;

  if(mess_type < 2)
    mess_type = mess_type + 1;
  else
    mess_type = 0;
}

void onHandleMessage(String received_string){
  Serial.print("[+] Data String C2D: ");
  Serial.printf(received_string.c_str());
  deserializeJson(doc, received_string);
  const uint8_t result = doc["Result"];
  const uint8_t id = doc["Id"];
  String jsonData = "[+] Data receive: " + String(result) + "," + String(id) + "\n";
  Serial.println(jsonData.c_str());
}

void receivedCallback(char* topic, byte* payload, unsigned int length)
{
  String received_string;
  Serial.print("Received [");
  Serial.print(topic);
  Serial.print("]: ");
  for (int i = 0; i < length; i++)
  {
    received_string += String((char)payload[i]);
  }
  onHandleMessage(received_string);
}

static void initializeClients()
{
  wifi_client.setTrustAnchors(&cert);
  if (az_result_failed(az_iot_hub_client_init(
          &client,
          az_span_create((uint8_t*)host, strlen(host)),
          az_span_create((uint8_t*)device_id, strlen(device_id)),
          NULL)))
  {
    Serial.println("Failed initializing Azure IoT Hub client");
    return;
  }

  mqtt_client.setServer(host, port);
  mqtt_client.setCallback(receivedCallback);
}

static uint32_t getSecondsSinceEpoch()
{
  return (uint32_t)time(NULL);
}

static int generateSasToken(char* sas_token, size_t size)
{
  az_span signature_span = az_span_create((uint8_t*)signature, sizeofarray(signature));
  az_span out_signature_span;
  az_span encrypted_signature_span
      = az_span_create((uint8_t*)encrypted_signature, sizeofarray(encrypted_signature));

  uint32_t expiration = getSecondsSinceEpoch() + ONE_HOUR_IN_SECS;

  // Get signature
  if (az_result_failed(az_iot_hub_client_sas_get_signature(
          &client, expiration, signature_span, &out_signature_span)))
  {
    Serial.println("Failed getting SAS signature");
    return 1;
  }

  // Base64-decode device key
  int base64_decoded_device_key_length
      = base64_decode_chars(device_key, strlen(device_key), base64_decoded_device_key);

  if (base64_decoded_device_key_length == 0)
  {
    Serial.println("Failed base64 decoding device key");
    return 1;
  }

  // SHA-256 encrypt
  br_hmac_key_context kc;
  br_hmac_key_init(
      &kc, &br_sha256_vtable, base64_decoded_device_key, base64_decoded_device_key_length);

  br_hmac_context hmac_ctx;
  br_hmac_init(&hmac_ctx, &kc, 32);
  br_hmac_update(&hmac_ctx, az_span_ptr(out_signature_span), az_span_size(out_signature_span));
  br_hmac_out(&hmac_ctx, encrypted_signature);

  // Base64 encode encrypted signature
  String b64enc_hmacsha256_signature = base64::encode(encrypted_signature, br_hmac_size(&hmac_ctx));

  az_span b64enc_hmacsha256_signature_span = az_span_create(
      (uint8_t*)b64enc_hmacsha256_signature.c_str(), b64enc_hmacsha256_signature.length());

  // URl-encode base64 encoded encrypted signature
  if (az_result_failed(az_iot_hub_client_sas_get_password(
          &client,
          expiration,
          b64enc_hmacsha256_signature_span,
          AZ_SPAN_EMPTY,
          sas_token,
          size,
          NULL)))
  {
    Serial.println("Failed getting SAS token");
    return 1;
  }

  return 0;
}

static int connectToAzureIoTHub()
{
  size_t client_id_length;
  char mqtt_client_id[128];
  if (az_result_failed(az_iot_hub_client_get_client_id(
          &client, mqtt_client_id, sizeof(mqtt_client_id) - 1, &client_id_length)))
  {
    Serial.println("Failed getting client id");
    return 1;
  }

  mqtt_client_id[client_id_length] = '\0';

  char mqtt_username[128];
  // Get the MQTT user name used to connect to IoT Hub
  if (az_result_failed(az_iot_hub_client_get_user_name(
          &client, mqtt_username, sizeofarray(mqtt_username), NULL)))
  {
    printf("Failed to get MQTT clientId, return code\n");
    return 1;
  }

  Serial.print("Client ID: ");
  Serial.println(mqtt_client_id);

  Serial.print("Username: ");
  Serial.println(mqtt_username);

  mqtt_client.setBufferSize(MQTT_PACKET_SIZE);

  while (!mqtt_client.connected())
  {
    time_t now = time(NULL);

    Serial.print("MQTT connecting ... ");

    if (mqtt_client.connect(mqtt_client_id, mqtt_username, sas_token))
    {
      Serial.println("connected.");
    }
    else
    {
      Serial.print("failed, status code =");
      Serial.print(mqtt_client.state());
      Serial.println(". Trying again in 5 seconds.");
      // Wait 5 seconds before retrying
      delay(5000);
    }
  }

  mqtt_client.subscribe(AZ_IOT_HUB_CLIENT_C2D_SUBSCRIBE_TOPIC);

  return 0;
}

void establishConnection() 
{
  connectToWiFi();
  initializeTime();
  printCurrentTime();
  initializeClients();

  // The SAS token is valid for 1 hour by default in this sample.
  // After one hour the sample must be restarted, or the client won't be able
  // to connect/stay connected to the Azure IoT Hub.
  if (generateSasToken(sas_token, sizeofarray(sas_token)) != 0)
  {
    Serial.println("Failed generating MQTT password");
  }
  else
  {
    connectToAzureIoTHub();
  }

  digitalWrite(LED_PIN, LOW);
}

void setup()
{
  pinMode(LED_PIN, OUTPUT);
  pinMode(BTN_PIN, INPUT);
  digitalWrite(LED_PIN, HIGH);
  establishConnection();
}

static char* getTelemetryPayload(int cond)
{
  switch (cond)
  {
    case RFID_IN_NUMBER:
    {
      long rfid_code = 22336688;
      doc.clear();
      doc["Method"] = METHOD_RFID_IN;
      doc["Gate"] = gate;
      doc["RfidCode"] = rfid_code;
      doc["ParkingAreaId"] = PARKING_AREA_ID;
      doc["Id"] = telemetry_send_count;
      telemetry_send_count = telemetry_send_count + 1;
      serializeJson(doc, telemetry_payload);
      break;
    }
    case NOTIFY_PARKING_NUMBER:
    {
      doc.clear();
      doc["Method"] = METHOD_NOTIFY_PARKING;
      switch (parking_slot_number)
      {
        case 0:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_1;
          break;
        }
        case 1:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_2;
          break;
        }
        case 2:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_3;
          break;
        }
        case 3:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_4;
          break;
        }
        default:
          break;
      }
      telemetry_send_count = telemetry_send_count + 1;
      serializeJson(doc, telemetry_payload);
      break;
    }
    case NOTIFY_UNPARKING_NUMBER:
    {
      doc.clear();
      doc["Method"] = METHOD_NOTIFY_UNPARKING;
      switch (parking_slot_number)
      {
        case 0:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_1;
          break;
        }
        case 1:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_2;
          break;
        }
        case 2:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_3;
          break;
        }
        case 3:
        {
          doc["ParkingSlotId"] = PARKING_SLOT_4;
          break;
        }
        default:
          break;
      }
      telemetry_send_count = telemetry_send_count + 1;
      serializeJson(doc, telemetry_payload);
      break;
    }
    default:
    {
      memset(telemetry_payload,0,MESSAGE_SIZE);
      break;
    }
  }
  Serial.print("[+] Message type:");
  Serial.println(mess_type);
  Serial.print("[+] Parking Slot Number:");
  Serial.println(parking_slot_number);
  Serial.print("[+] Payload generate: ");
  Serial.printf((char*)telemetry_payload);
  Serial.println();

  return (char*)telemetry_payload;
}

static void sendTelemetry()
{
  digitalWrite(LED_PIN, HIGH);
  Serial.print(millis());
  Serial.print(" ESP8266 Sending telemetry . . . ");
  if (az_result_failed(az_iot_hub_client_telemetry_get_publish_topic(
          &client, NULL, telemetry_topic, sizeof(telemetry_topic), NULL)))
  {
    Serial.println("Failed az_iot_hub_client_telemetry_get_publish_topic");
    return;
  }

  mqtt_client.publish(telemetry_topic, getTelemetryPayload(mess_type), false);
  increaseIndex();
  Serial.println("OK");
  delay(100);
  digitalWrite(LED_PIN, LOW);
}

void loop()
{
  if (millis() > next_telemetry_send_time_ms)
  {
    // Check if connected, reconnect if needed.
    if(!mqtt_client.connected())
    {
      establishConnection();
    }
    sendTelemetry();
    
    next_telemetry_send_time_ms = millis() + TELEMETRY_FREQUENCY_MILLISECS;
  }
  // MQTT loop must be called to process Device-to-Cloud and Cloud-to-Device.
  mqtt_client.loop();
  delay(500);
}